([
    {
        block: 'b-page',
        mods: { priv: 'post' },
        title: 'Опозиційна з народження',
        head: [
            {
                elem: 'favicon',
                url: '/favicon.ico'
            },
            {
                elem: 'css',
                url: '/pages/post/_post.css'
            },
            {
                block: 'i-jquery',
                elem: 'core'
            },
            {
                elem: 'js',
                url: '/pages/post/_index.js'
            }
        ],
        content: [
            {
                block: 'head',
                content: [
                    {
                        elem: 'logo',
                        content: [
                            {
                                block: 'b-icon'
                            }
                        ]
                    },
                    {
                        elem: 'title',
                        mix: [{ block: 'font' }],
                        content: [
                            {
                                block: 'b-link',
                                url: '/',
                                content: 'Блоґ Віталія Золотого'
                            }
                        ]
                    }
                ]
            },
            {
                block: 'section',
                content: [
                    {
                        block: 'article',
                        content: [
                            {
                                elem: 'title',
                                mix: [{ block: 'font' }],
                                content: 'Опозиційна з народження'
                            },
                            {
                                block: 'text',
                                content: [
                                    {
                                        elem: 'p',
                                        content: 'Галицькі українці не могли претендувати на більшість у представницьких органах, зауважує історик. Однак якби вони використали усі можливості, що їх надавала виборча система, то створені ними представництва могли би бути достатньо впливовими.'
                                    },
                                    {
                                        elem: 'p',
                                        content: 'Про тяглість парла́ментської традиції у можна говорити з 1861 року. Тоді австрійська влада визнала спроби сформувати єдине суспільство через централізацію і германізацію безрезультатними. І почала враховувати національні особливості, пішовши на реформи. Держава визнала рівноправність, гарантувала конституційні права і свободи.'
                                    },
                                    {
                                        elem: 'p',
                                        content: 'Водночас австрійську конституцію сьогодні важко було б назвати демократичною, вважає Адже в її основі до початку XX століття лежав середньовічний принцип представництва інтересів:'
                                    },
                                    {
                                        elem: 'blockquote',
                                        content: 'Чи знаєте, хлопці, як високо сокіл <br> під небом літає у теплії дні?'
                                    },
                                    {
                                        elem: 'p',
                                        content: 'Але цього не трапилося. Оскільки у середині ХІХ століття українці Галичини просто не були готовими до парламентської діяльності. Вони розглядали представницькі органи як дискусійні клуби для обміну думками.'
                                    },
                                    {
                                        elem: 'p',
                                        content: [
                                            'Так, право голосу мали тільки чоловіки. А також ',
                                            {
                                                block: 'b-link',
                                                url: '#',
                                                content: 'застосовувався'
                                            },
                                            ' майновий ценз. А оскільки українське суспільство складалося із двох головних верств – селянства і духовенства, - їм довелося виконувати роль політичної еліти. Тож не дивно, що переваги на виборах отримували заможні землевласники і міщани.']
                                    },
                                    {
                                        elem: 'p',
                                        content: 'А через неготовність діяти у легальному політичному просторі українці не змогли втримати навіть первісно призначених їм мандатів. Як наслідок – уже після других виборів число українців у парламентських установах суттєво зменшилося.'
                                    },
                                    {
                                        elem: 'p',
                                        content: 'Відтак галицький політикум ознаменувала справжня скандальна епоха, а українське представництво відігравало роль безпорадної опозиції, вважає дослідниця. Її діяльність зводилася до протестів і демонстративних виходів із зали засідань.'
                                    },
                                    {
                                        elem: 'p',
                                        content: 'Тим не менше, здобути депутатський мандат польський претендент міг лише голосами українських селян. Що було б дивним, зважаючи на попередні відносини типу "польський пан – український селянин". Однак чимало українських виборців віддавали свої голоси за польського землевласника свідомо.'
                                    },
                                    {
                                        block: 'b-icon',
                                        mix: [{ block: 'text', elem: 'img' }],
                                        url: '../../blocks/text/__img/text__img.jpg'
                                    },
                                    {
                                        elem: 'p',
                                        content: 'Водночас існував радикально інший погляд на прагнення поляків пробратися до парламенту завдяки українським селянам. Більше того, він відображав загальну тенденцію, яка полягала у зміцненні ідей національного інтересу, відмежуванні українців від польського інтелектуального і культурного простору. У той час це було основними завданнями модерного українського націєтворення.'
                                    },
                                    {
                                        elem: 'code',
                                        content: [
                                            {
                                                elem: 'pre',
                                                content: '.text__code'
                                            },
                                            {
                                                elem: 'pre',
                                                content: '{'
                                            },
                                            {
                                                elem: 'pre',
                                                content: '    font-size: 13px;'
                                            },
                                            {
                                                elem: 'pre',
                                                content: '    font-family: monospace;'
                                            },
                                            {
                                                elem: 'pre',
                                                content: '    display: block;'
                                            },
                                            {
                                                elem: 'pre',
                                                content: '    width: 320px;'
                                            },
                                            {
                                                elem: 'pre',
                                                content: '    margin: 20px auto;'
                                            },
                                            {
                                                elem: 'pre',
                                                content: '}'
                                            }
                                        ]
                                    },
                                    {
                                        elem: 'p',
                                        content: 'Галицькі українці не могли претендувати на більшість у представницьких органах, зауважує історик. Однак якби вони використали усі можливості, що їх надавала виборча система, то створені ними представництва могли би бути достатньо впливовими.'
                                    },
                                    {
                                        elem: 'p',
                                        content: 'Про тяглість парла́ментської традиції у можна говорити з 1861 року. Тоді австрійська влада визнала спроби сформувати єдине суспільство через централізацію і германізацію безрезультатними. І почала враховувати національні особливості, пішовши на реформи. Держава визнала рівноправність, гарантувала конституційні права і свободи.'
                                    },
                                    {
                                        elem: 'p',
                                        content: 'Водночас австрійську конституцію сьогодні важко було б назвати демократичною, вважає Адже в її основі до початку XX століття лежав середньовічний принцип представництва інтересів:'
                                    }
                                ]
                            },
                            {
                                elem: 'time',
                                attrs: { pubdate: '2012-08-26T02:39:22+00:00' },
                                content: '10 липня'
                            }
                        ]
                    }
                ]
            }
        ]
    }
])
