var blocks = {};

blocks['b-page'] = function(data) {
    return [
        {
            block: 'b-page',
            title: 'Вітер',
            head: [
                { elem: 'favicon', url: '/favicon.ico' },
                { elem: 'css', url: '/pages-desktop/index/_index.css' },
                { block: 'i-jquery', elem: 'core' },
                { elem: 'js', url: '/pages-desktop/index/_index.js' }
            ],
            // content: 'test: ' + data.page
            content: [
                {
                    block: 'head',
                    content: [
                        {
                            elem: 'logo',
                            content: [
                                {
                                    block: 'b-icon'
                                }
                            ]
                        },
                        {
                            elem: 'title',
                            mix: [{ block: 'font' }],
                            content: [
                                {
                                    block: 'b-link',
                                    url: '/',
                                    content: 'Блоґ Віталія Золотого'
                                }
                            ]
                        }
                    ]
                },
                {
                    block: 'section',
                    content: [
                        {
                            elem: 'inner',
                            content: [
                                {
                                    block: 'hentry',
                                    content: [
                                        {
                                            block: 'bullet',
                                            content: [
                                                {
                                                    block: 'b-icon'
                                                }
                                            ]
                                        },
                                        {
                                            elem: 'title',
                                            mix: [{ block: 'font' }],
                                            content: [
                                                {
                                                    block: 'b-link',
                                                    url: '#post=1',
                                                    attrs: { rel: 'bookmark' },
                                                    content: 'Опозиційна з народження'
                                                }
                                            ]
                                        },
                                        {
                                            elem: 'time',
                                            attrs: { pubdate: '2012-08-26T02:39:22+00:00' },
                                            content: '20 липня'
                                        },
                                        {
                                            block: 'text',
                                            content: [
                                                {
                                                    elem: 'p',
                                                    content: 'Про тяглість парла́ментської традиції у можна говорити з 1861 року. Тоді австрійська влада визнала спроби сформувати єдине суспільство через централізацію і германізацію безрезультатними. І почала враховувати національні особливості, пішовши на реформи. Держава визнала рівноправність, гарантувала конституційні права і свободи.'
                                                },
                                                {
                                                    elem: 'p',
                                                    content: 'Водночас австрійську конституцію сьогодні важко було б назвати демократичною, вважає Адже в її основі до початку XX століття лежав середньовічний принцип представництва інтересів:'
                                                },
                                                {
                                                    block: 'b-icon',
                                                    mix: [{ block: 'text', elem: 'img' }],
                                                    url: '../../blocks-desktop/text/__img/text__img.jpg',
                                                    width: '320px',
                                                    height: '320px'
                                                },
                                                {
                                                    elem: 'p',
                                                    content: 'Але цього не трапилося. Оскільки у середині ХІХ століття українці Галичини просто не були готовими до парламентської діяльності. Вони розглядали представницькі органи як дискусійні клуби для обміну думками.'
                                                },
                                                {
                                                    elem: 'p',
                                                    content: 'Так, право голосу мали тільки чоловіки. А також застосовувався майновий ценз. А оскільки українське суспільство складалося із двох головних верств – селянства і духовенства, - їм довелося виконувати роль політичної еліти. Тож не дивно, що переваги на виборах отримували заможні землевласники і міщани.'
                                                },
                                                {
                                                    elem: 'blockquote',
                                                    content: 'Чи знаєте, хлопці, як високо сокіл <br> під небом літає у теплії дні?'
                                                },
                                                {
                                                    elem: 'p',
                                                    content: 'Галицькі українці не могли претендувати на більшість у представницьких органах, зауважує історик. Однак якби вони використали усі можливості, що їх надавала виборча система, то створені ними представництва могли би бути достатньо впливовими.'
                                                },
                                                {
                                                    elem: 'code',
                                                    content: [
                                                        {
                                                            elem: 'pre',
                                                            content: '.text__code'
                                                        },
                                                        {
                                                            elem: 'pre',
                                                            content: '{'
                                                        },
                                                        {
                                                            elem: 'pre',
                                                            content: '    font-size: 13px;'
                                                        },
                                                        {
                                                            elem: 'pre',
                                                            content: '    font-family: monospace;'
                                                        },
                                                        {
                                                            elem: 'pre',
                                                            content: '    display: block;'
                                                        },
                                                        {
                                                            elem: 'pre',
                                                            content: '    width: 320px;'
                                                        },
                                                        {
                                                            elem: 'pre',
                                                            content: '    margin: 20px auto;'
                                                        },
                                                        {
                                                            elem: 'pre',
                                                            content: '}'
                                                        }
                                                    ]
                                                },
                                                {
                                                    elem: 'p',
                                                    content: 'А через неготовність діяти у легальному політичному просторі українці не змогли втримати навіть первісно призначених їм мандатів. Як наслідок – уже після других виборів число українців у парламентських установах суттєво зменшилося.'
                                                },
                                                {
                                                    elem: 'p',
                                                    content: 'Відтак галицький політикум ознаменувала справжня скандальна епоха, а українське представництво відігравало роль безпорадної опозиції, вважає дослідниця. Її діяльність зводилася до протестів і демонстративних виходів із зали засідань.'
                                                },
                                                {
                                                    elem: 'p',
                                                    content: 'Тим не менше, здобути депутатський мандат польський претендент міг лише голосами українських селян. Що було б дивним, зважаючи на попередні відносини типу "польський пан – український селянин". Однак чимало українських виборців віддавали свої голоси за польського землевласника свідомо.'
                                                },
                                                {
                                                    elem: 'p',
                                                    content: 'Водночас існував радикально інший погляд на прагнення поляків пробратися до парламенту завдяки українським селянам. Більше того, він відображав загальну тенденцію, яка полягала у зміцненні ідей національного інтересу, відмежуванні українців від польського інтелектуального і культурного простору. У той час це було основними завданнями модерного українського націєтворення.'
                                                },
                                            ]
                                        },
                                    ]
                                },
                                {
                                    block: 'hentry',
                                    content: [
                                        {
                                            elem: 'title',
                                            mix: [{ block: 'font' }],
                                            content: [
                                                {
                                                    block: 'b-link',
                                                    url: '#post=1',
                                                    attrs: { rel: 'bookmark' },
                                                    content: 'Таємниця шостого кварталу'
                                                }
                                            ]
                                        },
                                        // {
                                        //     elem: 'time',
                                        //     attrs: { pubdate: '2012-08-26T02:39:22+00:00' },
                                        //     content: '10 липня'
                                        // },
                                        {
                                            block: 'text',
                                            content: [
                                                {
                                                    elem: 'p',
                                                    content: 'Незначне число українців у австрійському парламенті пояснювалося ще й відкритою конкуренцією. Українські кандидати змагалися не тільки між собою, але й з польськими землевласниками.'
                                                },
                                                {
                                                    elem: 'p',
                                                    content: 'Треба сказати, що польські політики у жодному разі не позиціонували себе у ролі національної меншини. Вони стверджували, що "століттями працюючи, живучи і воюючи на Русі, заробили своє право бути місцевою елітою". Натомість політичну активність нової української інтелігенції називали радикалізмом та прагненням розхитати усталений порядок.'
                                                },
                                                {
                                                    elem: 'p',
                                                    content: 'Чутки про таємний цвинтар НКВД у приміському лісі кружляли від кінця 1960-х, коли місцеві школярі почали свою "охоту за черепами". КГБ тоді мусило терміново вживати заходів'
                                                },
                                                {
                                                    elem: 'p',
                                                    content: 'У розпал спекотного літа 1991 року звістка про виявлення в 6-му кварталі Лісопарку м. Харкова поблизу селища П’ятихатки масового поховання військовополонених польських офіцерів і радянських громадян для багатьох пересічних харків’ян стала справжнім інформаційним шоком. Проте вона не заскочила пошуковців Харківського міського товариства "Меморіал", які упродовж двох попередніх років зібрали багато усних свідчень харків’ян, в першу чергу мешканців селища П’ятихатки, про страшні знахідки місцевих школярів, яків другій половині 60-х років ХХ століття займалися на цьому місці несанкціонованими розкопками.'
                                                },
                                                {
                                                    elem: 'p',
                                                    content: 'Увагу "Меморіалу" до цього місця привернув один із науковців Українського фізико-технічного інституту Академії Наук УРСР, який восени 1989 року приніс в офіс товариства копію аркуша з журналу фіксації подій Оперативного загону інституту (в радянські часи такі оперзагони утворювалися секретними службами для допомоги міліції в боротьбі з хуліганами на територіях навколо режимних об’єктів, яким був власне УФТІ).'
                                                },
                                                {
                                                    elem: 'p',
                                                    content: 'Дослідники знайшли також старожилів, які надали свідчення про те, що в другій половині 1930-х років і до початку окупації Харкова восени 1941 р. на огородженій високим дерев’яним парканом ділянці 6-го кварталу Лісопарку чоловіки у військовій (але не в армійській) формі вдень проводили якісь земляні роботи. Їх бачили часто з чайниками біля колодязя, яким користувалися місцеві мешканці. З-за паркану було чути собачий гавкіт.'
                                                },
                                            ]
                                        },
                                    ]
                                },
                            ]
                        }
                    ]
                },
                {
                    block: 'aside',
                    content: [
                        {
                            elem: 'inner',
                            content: [
                                {
                                    block: 'text',
                                    content: [
                                        {
                                            elem: 'ol',
                                            content: [
                                                {
                                                    elem: 'li',
                                                    attrs: { rel: 'prev' },
                                                    content: [
                                                        {
                                                            block: 'b-link',
                                                            url: '#p1',
                                                            content: 'Отаман і його армія'
                                                        }
                                                    ]
                                                },
                                                {
                                                    elem: 'li',
                                                    attrs: { rel: 'next' },
                                                    content: [
                                                        {
                                                            block: 'b-link',
                                                            url: '#p2',
                                                            content: 'Таємниця шостого кварталу'
                                                        }
                                                    ]
                                                },
                                            ]
                                        },
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    block: 'nav',
                    content: [
                        {
                            block: 'bullet',
                            content: [
                                {
                                    block: 'b-icon'
                                }
                            ]
                        },
                        {
                            elem: 'item',
                            attrs: { rel: 'prev' },
                            content: [
                                {
                                    block: 'b-link',
                                    url: '#prev',
                                    content: 'Минуле'
                                }
                            ]
                        },
                        {
                            elem: 'count',
                            content: '2 ⁄ 2'
                        },
                        {
                            elem: 'item',
                            attrs: { rel: 'next' },
                            content: [
                                {
                                    block: 'b-link',
                                    url: '#next',
                                    content: 'Майбутнє'
                                }
                            ]
                        }
                    ]
                },
                {
                    block: 'foot',
                    content: [
                        {
                            elem: 'author',
                            content: [
                                '© ',
                                {
                                    block: 'b-link',
                                    url: 'mailto:vitaly.zolotoy@mail.com',
                                    attrs: { rel: 'author' },
                                    content: 'Віталій Золотой'
                                }
                            ]
                        },
                        {
                            elem: 'year',
                            content: ' · 2011…2012 рр.'
                        }
                    ]
                }
            ]
        }
    ]
};
